## Staging: idp
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 9 to add, 4 to change, 7 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                     NAME                                                     |
|----------|--------------------------------------------------------------------------------------------------------------|
| add      | `aws_iam_policy.user_portal_secrets_manager`                                                                 |
|          | `aws_iam_role_policy_attachment.ecs_secrets`                                                                 |
|          | `aws_iam_role_policy_attachment.ecs_task_execution_user_portal`                                              |
| delete   | `aws_iam_role_policy_attachment.ecs_task_execution_forms`                                                    |
| update   | `module.user_portal_code_pipeline[0].aws_codebuild_project.ecs_render`                                       |
|          | `module.user_portal_code_pipeline[0].aws_codepipeline.this`                                                  |
|          | `module.user_portal_code_pipeline[0].aws_iam_role.this`                                                      |
|          | `module.user_portal_code_pipeline[0].aws_iam_role_policy.codepipeline_policy`                                |
| recreate | `aws_ecs_task_definition.user_portal`                                                                        |
|          | `module.user_portal_code_pipeline[0].aws_codepipeline_webhook.this`                                          |
|          | `module.user_portal_code_pipeline[0].aws_s3_bucket.codepipeline_bucket`                                      |
|          | `module.user_portal_code_pipeline[0].aws_s3_bucket_ownership_controls.codepipeline_bucket`                   |
|          | `module.user_portal_code_pipeline[0].aws_s3_bucket_public_access_block.codepipeline_bucket`                  |
|          | `module.user_portal_code_pipeline[0].aws_s3_bucket_server_side_encryption_configuration.codepipeline_bucket` |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/forms-terraform/actions/runs/21726406114).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_ecs_task_definition.user_portal must be replaced
-/+ resource "aws_ecs_task_definition" "user_portal" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:687401027353:task-definition/user_portal:10" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:687401027353:task-definition/user_portal" -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "user_portal" -> (known after apply)
      ~ revision                 = 10 -> (known after apply)
      - tags                     = {} -> null
        # (13 unchanged attributes hidden)
    }

  # aws_iam_policy.user_portal_secrets_manager will be created
  + resource "aws_iam_policy" "user_portal_secrets_manager" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "userPortalSecretsManagerKeyRetrieval"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:notify_api_key-eR3nNp"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role_policy_attachment.ecs_secrets will be created
  + resource "aws_iam_role_policy_attachment" "ecs_secrets" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "idp_user_portal"
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_forms will be destroyed
  # (because aws_iam_role_policy_attachment.ecs_task_execution_forms is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ecs_task_execution_forms" {
      - id         = "idp_user_portal/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy" -> null
      - role       = "idp_user_portal" -> null
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_user_portal will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_user_portal" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "idp_user_portal"
    }

  # module.user_portal_code_pipeline[0].data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.user_portal_code_pipeline[0].data.aws_ecs_task_definition.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + region                   = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "user_portal"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.user_portal_code_pipeline[0].data.aws_iam_policy_document.assume_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "codebuild.amazonaws.com",
                  + "codedeploy.amazonaws.com",
                  + "codepipeline.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.user_portal_code_pipeline[0].data.aws_iam_policy_document.codepipeline_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "codepipeline_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketVersioning",
              + "s3:GetObject",
              + "s3:GetObjectVersion",
              + "s3:PutObject",
              + "s3:PutObjectAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "codestar-connections:UseConnection",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:codestar-connections:ca-central-1:687401027353:connection/52d97e46-64f4-45ce-b02d-ae183f0d9f3c",
            ]
        }
      + statement {
          + actions   = [
              + "codebuild:BatchGetBuilds",
              + "codebuild:StartBuild",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "codeconnections:GetConnection",
              + "codeconnections:GetConnectionToken",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:codestar-connections:ca-central-1:687401027353:connection/52d97e46-64f4-45ce-b02d-ae183f0d9f3c",
            ]
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:CompleteLayerUpload",
              + "ecr:DescribeRepositories",
              + "ecr:GetAuthorizationToken",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:InitiateLayerUpload",
              + "ecr:PutImage",
              + "ecr:UploadLayerPart",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "codedeploy:CreateDeployment",
              + "codedeploy:GetDeployment",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "codedeploy:GetApplication",
              + "codedeploy:GetApplicationRevision",
              + "codedeploy:RegisterApplicationRevision",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "codedeploy:GetDeploymentConfig",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ecs:DescribeServices",
              + "ecs:DescribeTaskDefinition",
              + "ecs:RegisterTaskDefinition",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateNetworkInterface",
              + "ec2:DeleteNetworkInterface",
              + "ec2:DescribeDhcpOptions",
              + "ec2:DescribeNetworkInterfaces",
              + "ec2:DescribeSecurityGroups",
              + "ec2:DescribeSubnets",
              + "ec2:DescribeVpcs",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateNetworkInterfacePermission",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "codestar-connections:UseConnection",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:iam::*:role/Service*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.user_portal_code_pipeline[0].data.aws_lb_target_group.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = (known after apply)
      + health_check                       = (known after apply)
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = (known after apply)
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "user-portal-0"
      + port                               = (known after apply)
      + preserve_client_ip                 = (known after apply)
      + protocol                           = (known after apply)
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = (known after apply)
      + region                             = (known after apply)
      + slow_start                         = (known after apply)
      + stickiness                         = (known after apply)
      + tags                               = (known after apply)
      + target_type                        = (known after apply)
      + vpc_id                             = (known after apply)
    }

  # module.user_portal_code_pipeline[0].data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.user_portal_code_pipeline[0].aws_codebuild_project.ecs_render will be updated in-place
  ~ resource "aws_codebuild_project" "ecs_render" {
        id                     = "arn:aws:codebuild:ca-central-1:687401027353:project/ECS-Render-idp_user_portal"
        name                   = "ECS-Render-idp_user_portal"
        tags                   = {}
        # (15 unchanged attributes hidden)

      ~ source {
          ~ buildspec           = jsonencode(
                {
                  - artifacts = {
                      - files = [
                          - "appspec.yaml",
                          - "task_definition.json",
                        ]
                    }
                  - env       = {
                      - parameter-store = {}
                      - secrets-manager = {}
                      - variables       = {}
                    }
                  - phases    = {
                      - build      = {
                          - commands   = [
                              - "aws ecr get-login-password --region ca-central-1 | docker login --username AWS --password-stdin 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal",
                              - "docker build -t base .",
                              - "docker tag base 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:latest",
                              - "docker push 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:latest",
                              - "docker tag base 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:$GIT_COMMIT_ID",
                              - "docker push 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:$GIT_COMMIT_ID",
                              - "export GIT_TAG=$(git tag --points-at $GIT_COMMIT_ID)",
                              - "if [[ -n \"$GIT_TAG\" ]]; then docker tag base 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:$GIT_TAG && docker push 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:$GIT_TAG; fi",
                            ]
                          - finally    = [
                              - "docker logout 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal",
                            ]
                          - on-failure = "ABORT"
                        }
                      - post_build = {
                          - commands   = [
                              - "printf \"$APPSPEC\" > appspec.yaml",
                              - "aws ecs describe-task-definition --task-definition user_portal --query taskDefinition | jq --arg gitCommit \"$GIT_COMMIT_ID\" '.taskDefinitionArn |= \"arn:aws:ecs:ca-central-1:687401027353:task-definition/user_portal\" | .containerDefinitions |= map(select(.name == \"user_portal\").image |= \"687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:\" + $gitCommit)' > task_definition.json",
                            ]
                          - on-failure = "ABORT"
                        }
                    }
                  - version   = 0.2
                }
            ) -> (known after apply)
            # (5 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.user_portal_code_pipeline[0].aws_codepipeline.this will be updated in-place
  ~ resource "aws_codepipeline" "this" {
        id             = "idp_user_portal-pipeline"
        name           = "idp_user_portal-pipeline"
        tags           = {}
        # (7 unchanged attributes hidden)

      - artifact_store {
          - location = "687401027353-pipeline" -> null
          - type     = "S3" -> null
            # (1 unchanged attribute hidden)
        }
      + artifact_store {
          + location = (known after apply)
          + type     = "S3"
            # (1 unchanged attribute hidden)
        }

      ~ stage {
            name = "Build"

          ~ action {
              ~ configuration      = {
                  - "EnvironmentVariables" = jsonencode(
                        [
                          - {
                              - name  = "GIT_COMMIT_ID"
                              - type  = "PLAINTEXT"
                              - value = "#{GitSource.CommitId}"
                            },
                          - {
                              - name  = "TASKDEF_FAMILY"
                              - type  = "PLAINTEXT"
                              - value = "user_portal"
                            },
                          - {
                              - name  = "APPSPEC"
                              - type  = "PLAINTEXT"
                              - value = <<-EOT
                                    version: 0.0
                                    Resources:
                                      - TargetService:
                                          Type: AWS::ECS::Service
                                          Properties:
                                            PlatformVersion: LATEST
                                            TaskDefinition: <TASK_DEFINITION>
                                            LoadBalancerInfo:
                                              ContainerName: user_portal
                                              ContainerPort: 3000
                                EOT
                            },
                        ]
                    )
                  - "PrimarySource"        = "GitSource"
                  - "ProjectName"          = "ECS-Render-idp_user_portal"
                } -> (known after apply)
                name               = "Render_For_ECS"
                # (11 unchanged attributes hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.user_portal_code_pipeline[0].aws_codepipeline_webhook.this must be replaced
-/+ resource "aws_codepipeline_webhook" "this" {
      ~ arn             = "arn:aws:codepipeline:ca-central-1:687401027353:webhook:github-webhook-idp_user_portal" -> (known after apply)
      ~ id              = "arn:aws:codepipeline:ca-central-1:687401027353:webhook:github-webhook-idp_user_portal" -> (known after apply)
        name            = "github-webhook-idp_user_portal"
      - tags            = {} -> null
      ~ url             = "https://ca-central-1.webhooks.aws/trigger?t=eyJlbmNyeXB0ZWREYXRhIjoibzRET0d2M08wZE5kZ3RZeUNUc0dJTjJWd2NucmRUMVRJcFpwRFVkT1hMMENOMkFVZ24rMS9wRHdHUzkxUElVVGE4L0paVlpLYitKaXFQLzNQUjVPcWl5NWo4KzV1eW42NmFTNFZsWHZBekZ0d2ovajUyNnNHQmxscUMxa3dWbTJCb1FYd3UyK2ZnOFNPQnFwaDgxcXdoRmhOT3VGNXRBV3AyUHhxSWNxMmJlWURBPT0iLCJpdlBhcmFtZXRlclNwZWMiOiIyU1d6cjZPaW44NlFnSEppIiwibWF0ZXJpYWxTZXRTZXJpYWwiOjF9&v=1" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ authentication_configuration {
          ~ secret_token     = (sensitive value) # forces replacement
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.user_portal_code_pipeline[0].aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = [
                              - "codepipeline.amazonaws.com",
                              - "codedeploy.amazonaws.com",
                              - "codebuild.amazonaws.com",
                            ]
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "Code-Pipeline-idp_user_portal"
        name                  = "Code-Pipeline-idp_user_portal"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.user_portal_code_pipeline[0].aws_iam_role_policy.codepipeline_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "codepipeline_policy" {
        id          = "Code-Pipeline-idp_user_portal:codepipeline_policy"
        name        = "codepipeline_policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                          - "s3:GetObjectVersion",
                          - "s3:GetObject",
                          - "s3:GetBucketVersioning",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::687401027353-pipeline/*",
                          - "arn:aws:s3:::687401027353-pipeline",
                        ]
                    },
                  - {
                      - Action   = "codestar-connections:UseConnection"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:codestar-connections:ca-central-1:687401027353:connection/52d97e46-64f4-45ce-b02d-ae183f0d9f3c"
                    },
                  - {
                      - Action   = [
                          - "codebuild:StartBuild",
                          - "codebuild:BatchGetBuilds",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "codeconnections:GetConnectionToken",
                          - "codeconnections:GetConnection",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:codestar-connections:ca-central-1:687401027353:connection/52d97e46-64f4-45ce-b02d-ae183f0d9f3c"
                    },
                  - {
                      - Action   = [
                          - "ecr:UploadLayerPart",
                          - "ecr:PutImage",
                          - "ecr:InitiateLayerUpload",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:DescribeRepositories",
                          - "ecr:CompleteLayerUpload",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "codedeploy:GetDeployment",
                          - "codedeploy:CreateDeployment",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:codedeploy:*:687401027353:deploymentgroup:idp_user_portal/*"
                    },
                  - {
                      - Action   = [
                          - "codedeploy:RegisterApplicationRevision",
                          - "codedeploy:GetApplicationRevision",
                          - "codedeploy:GetApplication",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:codedeploy:*:687401027353:application:idp_user_portal/*",
                          - "arn:aws:codedeploy:*:687401027353:application:idp_user_portal",
                        ]
                    },
                  - {
                      - Action   = "codedeploy:GetDeploymentConfig"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:codedeploy:*:687401027353:deploymentconfig:*"
                    },
                  - {
                      - Action   = [
                          - "ecs:RegisterTaskDefinition",
                          - "ecs:DescribeTaskDefinition",
                          - "ecs:DescribeServices",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "ec2:DescribeVpcs",
                          - "ec2:DescribeSubnets",
                          - "ec2:DescribeSecurityGroups",
                          - "ec2:DescribeNetworkInterfaces",
                          - "ec2:DescribeDhcpOptions",
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:CreateNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "ec2:CreateNetworkInterfacePermission"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ec2:ca-central-1:687401027353:network-interface/*"
                    },
                  - {
                      - Action   = "codestar-connections:UseConnection"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::*:role/Service*"
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::687401027353:role/idp_user_portal"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.user_portal_code_pipeline[0].aws_s3_bucket.codepipeline_bucket must be replaced
-/+ resource "aws_s3_bucket" "codepipeline_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::687401027353-pipeline" -> (known after apply)
      ~ bucket                      = "687401027353-pipeline" -> (known after apply) # forces replacement
      ~ bucket_domain_name          = "687401027353-pipeline.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_region               = "ca-central-1" -> (known after apply)
      ~ bucket_regional_domain_name = "687401027353-pipeline.s3.ca-central-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z1QDHH18159H29" -> (known after apply)
      ~ id                          = "687401027353-pipeline" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (3 unchanged attributes hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "8ee828b5522b38b6797b8f886ed0b30f039d4eaa7ea331fa60669a6e0352d7e5" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # module.user_portal_code_pipeline[0].aws_s3_bucket_ownership_controls.codepipeline_bucket must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "codepipeline_bucket" {
      ~ bucket = "687401027353-pipeline" -> (known after apply) # forces replacement
      ~ id     = "687401027353-pipeline" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.user_portal_code_pipeline[0].aws_s3_bucket_public_access_block.codepipeline_bucket must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "codepipeline_bucket" {
      ~ bucket                  = "687401027353-pipeline" -> (known after apply) # forces replacement
      ~ id                      =...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.idp_protocol_version"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.user_portal[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.user_portal[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.idp"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.user_portal[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecs_xray"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.user_portal_secrets_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.user_portal_ssm"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.idp_user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.idp"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codebuild_project.ecs_render"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codedeploy_app.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codedeploy_deployment_group.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codepipeline.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codepipeline_webhook.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codestarconnections_connection.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_iam_role.this"]
WARN - plan.json...
```

</details>
